Repository: shams-sayed81/gym_app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# app_tagline
source: Your complete fitness ecosystem
ar: نظامك المتكامل للياقة البدنية

source: Welcome Back
ar: مرحبًا بعودتك

# select_role
source: Select your role to continue
ar: اختر دورك للمتابعة

source: Member
ar: عضو

source: Coach
ar: مدرب

source: Admin
ar: مسؤول

source: Log In
ar: تسجيل الدخول

# no_account
source: Don't have an account?
ar: ليس لديك حساب؟

source: Email or phone
ar: البريد الإلكتروني أو رقم الهاتف

source: Password
ar: كلمة المرور

source: Required field
ar: حقل مطلوب

# already_have_account
source: Already have an account?
ar: لديك حساب بالفعل؟

source: Log in
ar: تسجيل الدخول

source: Sign up
ar: إنشاء حساب

source: Create account
ar: إنشاء حساب

source: Phone (optional)
ar: رقم الهاتف (اختياري)

# main_goal_question
source: What's your main goal?
ar: ما هو هدفك الرئيسي؟

# main_goal_description
source: This helps us personalize your training plan.
ar: هذا يساعدنا على تخصيص خطة التدريب الخاصة بك.

# continu
source: Continue
ar: استمرار

source: Build Muscle
ar: بناء العضلات

# hypertrophy
source: Hypertrophy & Strength
ar: زيادة حجم العضلات

source: Lose Weight
ar: فقدان الوزن

source: Fat Loss & Toning
ar: حرق الدهون & شد الجسم

source: Endurance
ar: التحمل

source: Cardio & Stamina
ar: تمارين الكارديو & قوة التحمل

source: Flexibility
ar: المرونة

source: Mobility & Health
ar: الحركة & الصحة

source: Step
ar: خطوة

source: Training Frequency
ar: تكرار التدريب

source: Back
ar: رجوع

# training_question
source: How many days a week can you train?
ar: كم عدد الأيام التي يمكنك التدريب فيها أسبوعيًا؟

# days_per_week
source: days/week
ar: أيام / أسبوع

# recommended_days
source: Recommended: 3-5 days for consistent results.
ar: موصى به: 3-5 أيام للحصول على نتائج مستمرة.

source: Session Duration
ar: مدة الجلسة

# session_duration_question
source: How much time do you have per session?
ar: كم من الوقت لديك في كل جلسة؟

source: Mins
ar: دقائق

source: Express
ar: سريع

source: Standard
ar: قياسي

source: Optimal
ar: مثالي

source: Extended
ar: ممتد

source: All Set!
ar: جاهز!

# plan_ready_message
source: We have everything we need to build your personalized training and nutrition plan.
ar: لدينا كل ما نحتاجه لإنشاء خطة التدريب والتغذية المخصصة لك.

source: Frequency:
ar: عدد الأيام:

source: Goal:
ar: الهدف:

source: Duration:
ar: المدة:

source: Generate Plan
ar: إنشاء الخطة

source: Home
ar: الرئيسية

source: Train
ar: تدريب

source: Eat
ar: تغذية

source: Shop
ar: المتجر

source: Me
ar: حسابي

source: Pro Member
ar: عضو مميز

source: Account
ar: الحساب

source: Personal Details
ar: البيانات الشخصية

source: Membership & Billing
ar: العضوية والفواتير

source: Visit History
ar: سجل الزيارات

source: Settings
ar: الإعدادات

source: Notifications
ar: الإشعارات

# language
source: EN
ar: AR

# language_option
source: Language
ar: اللغة

source: Log Out
ar: تسجيل الخروج

# category_all
source: All
ar: الكل

# category_supplements
source: Supplements
ar: المكملات الغذائية

# category_apparel
source: Apparel
ar: الملابس

# category_gear
source: Gear
ar: المعدات

# category_accessories
source: Accessories
ar: الإكسسوارات

source: My Cart
ar: سلتي

# cart_empty
source: Your cart is empty
ar: سلتك فارغة

source: Close
ar: إغلاق

source: Start Shopping
ar: ابدأ التسوق

source: Market
ar: السوق

source: Checkout
ar: الدفع

source: Search Products
ar: ابحث عن المنتجات

source: Total
ar: الإجمالي

source: Today's Workout
ar: تمرين اليوم

source: View Plan
ar: عرض الخطة

source: kcal
ar: سعرات حرارية

source: Exercises
ar: تمارين

source: Start Workout
ar: ابدأ التمرين

source: Nutrition
ar: التغذية

source: Log Meal
ar: سجل وجبتك

source: Calories
ar: السعرات الحرارية

source: Protein
ar: البروتين

source: Activity
ar: النشاط

# weight_kg
source: Kg Weight
ar: الوزن (كغ)

# sleep_hrs
source: Hrs Sleep
ar: ساعات النوم

# water_l
source: L Water
ar: الماء (لتر)

source: No Meal Plan
ar: لا توجد خطة وجبات

# generate_nutrition_plan
source: Generate a nutrition plan using the AI Coach to see your daily meals.
ar: قم بإنشاء خطة تغذية باستخدام المدرب الذكي للاطلاع على وجباتك اليومية.

source: No Active Plan
ar: لا توجد خطة نشطة

# no_training_plan_yet
source: You haven't generated a personalized training plan yet. Use the AI Coach to get started.
ar: لم تقم بإنشاء خطة تدريب شخصية بعد. استخدم المدرب الذكي للبدء.

source: No products
ar: لا توجد منتجات

source: Generate AI Plan
ar: توليد خطة AI

source: Custom Workouts and Nutrition
ar: تمارين وخطة تغذية مخصصة

source: Strength
ar: القوة

source: Next Step
ar: الخطوة التالية

source: Target Body Shape
ar: شكل الجسم المستهدف

source: V-Taper
ar: جسم على شكل حرف V

source: Lean and Toned
ar: رشيق ومشدود

source: Bulky
ar: ضخم

source: Athletic
ar: رياضي

source: Schedule and Training
ar: الجدول والتدريب

source: Nutrition Preference
ar: نظام التغذية المفضل

source: Balanced
ar: متوازن

source: Keto
ar: كيتو

source: Vegan
ar: نباتي

source: High Protein
ar: عالي البروتين

source: Paleo
ar: باليو

source: Profile
ar: الملف الشخصي

source: Schedule
ar: الجدول

source: Chat
ar: الدردشة

source: Members
ar: الأعضاء

source: Upcoming
ar: قادمة

source: Ongoing
ar: جارية

source: Completed
ar: مكتملة

source: Day
ar: يوم

source: Week
ar: أسبوع

source: Year
ar: سنة

source: Month
ar: شهر

# track_progress
source: Track your progress and view projections based on your plan.
ar: تابع تقدمك واطّلع على التوقعات بناءً على خطتك.

source: Weight Tracker
ar: متابعة الوزن

source: Log Weight
ar: تسجيل الوزن

# analysis_projection
source: Analysis and Projection
ar: التحليل والتوقعات

source: Save Changes
ar: حفظ التغييرات

source: Update Current Weight
ar: تحديث الوزن الحالي

source: Sleep Log
ar: تسجيل النوم

# log_sleep_duration
source: Log your sleep duration to monitor recovery.
ar: سجّل مدة نومك لمتابعة التعافي.

source: Below Recommended Amount
ar: أقل من المعدل الموصى به

source: Optimal Recovery Zone
ar: منطقة التعافي المثالية

source: Why it matters?
ar: لماذا هذا مهم؟

# sleep_importance_description
source: Sleep is when your muscles repair and grow. Aiming for 7-9 hours helps optimize your gains from the "Upper Body Power" plan.
ar: النوم هو الوقت الذي تتعافى فيه عضلاتك وتنمو. استهداف من 7 إلى 9 ساعات يساعدك على تحقيق أفضل نتائج من خطة "قوة الجزء العلوي من الجسم".

source: hrs
ar: ساعات

source: Hydration
ar: الترطيب

# hydration_description
source: Keep track of your daily water intake.
ar: تابع كمية الماء التي تشربها يوميًا.

# hydration_daily_goal
source: Daily Goal: 3.0 Liters
ar: الهدف اليومي: 3.0 لتر

source: Let's Get Started
ar: لنبدأ

# choose_plan_method
source: Choose how you want to build your training plan.
ar: اختر الطريقة التي تريد بها بناء خطة تدريبك.

source: Design manually
ar: تصميم يدوي

source: Ask AI Coach
ar: اسأل المدرب الذكي

source: Real Coach
ar: مدرب حقيقي

# select_days_exercises
source: Select your days and exercises
ar: اختر أيامك والتمارين

source: Instant personalized plan
ar: خطة شخصية فورية

# request_professional_plan
source: Request a professional plan
ar: اطلب خطة احترافية

source: Log Food
ar: تسجيل طعام

# ate_something_else
source: I ate something else
ar: أكلت شيئًا آخر

source: Eaten Today
ar: ما تم تناوله اليوم

# all_meals_completed
source: All planned meals completed! ðŸŽ‰
ar: تم إكمال جميع الوجبات المخططة! 🎉

source: Logged
ar: تم التسجيل

source: Upcoming Meals
ar: الوجبات القادمة

# tap_search_egyptian_food
source: Tap to search the Egyptian Food Database
ar: اضغط للبحث في قاعدة بيانات الأطعمة المصرية

source: All
ar: الكل

source: Breakfast
ar: فطور

source: Lunch
ar: غداء

source: Dinner
ar: عشاء

source: Dessert
ar: تحلية

source: Snack
ar: سناك

source: Popular Food
ar: أطعمة شائعة

source: Food Search
ar: البحث عن طعام

source: Supplements
ar: مكملات غذائية

source: Apparel
ar: ملابس

source: Gear
ar: معدات

source: Accessories
ar: إكسسوارات

source: Input your own macros and meals
ar: ادخل الماكروز والوجبات الخاصة بك

source: Generate a meal plan instantly
ar: إنشئ خطة وجبات فورياً

source: Request a plan from your trainer
ar: اطلب خطة من مدربك

source: Set manually
ar: اضبط يدوياً

source: Fuel Your Body
ar: غذّي جسمك

# choose_how_to_build_plan
source: Choose how you want to build your nutrition plan
ar: اختر كيف تريد بناء خطة تغذيتك

source: AI Coach
ar: المدرب الذكي

source: Your personal fitness assistant
ar: مساعدك الشخصي في اللياقة البدنية

# hello_ai_coach
source: Hello! I'm your AI Coach. I can help you customize your training, build meal plans, or adjust your goals. What would you like to do today?
ar: مرحباً! أنا مدربك الذكي. أستطيع مساعدتك في تخصيص تدريبك، إعداد خطط وجبات، أو تعديل أهدافك. ماذا تريد أن تفعل اليوم؟

source: Ask your AI Coach
ar: اسأل مدربك الذكي

source: Create new training plan
ar: إنشاء خطة تدريب جديدة

source: Adjust my workout day
ar: تعديل يوم التمرين الخاص بي

source: I want to lose fat
ar: أريد خسارة الدهون

source: Make nutrition plan
ar: إعداد خطة التغذية

source: Strong
ar: قوي

source: Focus
ar: تركيز

source: High
ar: عالٍ

source: Intensity
ar: شدة

source: Next Set
ar: المجموعة التالية

source: Previous
ar: السابق

source: Find a Coach
ar: ابحث عن مدرب

# select_a_pro_to_build_workout
source: Select a pro to build your workout plan
ar: اختر محترفًا لبناء خطة التمرين الخاصة بك

source: Hire Coach
ar: توظيف مدرب

source: Confirm Request
ar: تأكيد الطلب

# you_are_about_to_hire_coach
source: You are about to hire
ar: أنت على وشك توظيف

source: Service
ar: الخدمة

source: Turnaround
ar: مدة التنفيذ

source: Confirm and Pay
ar: تأكيد والدفع

source: Request Sent
ar: تم إرسال الطلب

# waiting_for_coach
source: Waiting for Mike Mentzer to create your plan.
ar: في انتظار مايك منتزر لإنشاء خطتك.

# usually_takes_time
source: Usually takes 24-48 hours.
ar: يستغرق عادة من 24 إلى 48 ساعة.

source: Back to Dashboard
ar: العودة إلى لوحة التحكم

source: Plan Ready!
ar: الخطة جاهزة!

# coach_designed_plan
source: Your coach has designed your new workout plan.
ar: قام مدربك بتصميم خطة التمرين الجديدة الخاصة بك.

# coach_proposal
source: Coach's Proposal
ar: مقترح المدرب

# review_details_before_accepting
source: Review the details before accepting.
ar: راجع التفاصيل قبل القبول.

source: Target Goal
ar: الهدف

source: Coach Assigned (Training)
ar: المدرب المخصص (التدريب)

source: Weekly Schedule
ar: الجدول الأسبوعي

source: Accept Plan
ar: قبول الخطة

source: Reject Plan
ar: رفض الخطة

source: Price
ar: السعر

source: Cancel
ar: إلغاء

source: Fit
ar: لياقة

source: Fat Loss
ar: خسارة الدهون

source: Low Activity
ar: نشاط منخفض

# neww
source: New
ar: جديد

source: Today's Sessions
ar: جلسات اليوم

source: View Full Schedule
ar: عرض الجدول الكامل

source: Members to Follow Up
ar: الأعضاء الذين يحتاجون للمتابعة

source: Open
ar: مفتوح

source: Create Plan
ar: إنشاء خطة

source: Workout Completion Rate
ar: نسبة إكمال التمرين

source: Add Session
ar: إضافة جلسة

source: Broadcast
ar: بث

source: Create Workout Plan
ar: إنشاء خطة تمرين

# design_new_training_program
source: Design a new training program for a member.
ar: تصميم برنامج تدريبي جديد لعضو.

source: Select Member
ar: اختيار العضو

source: Plan Name
ar: اسم الخطة

source: Duration (Weeks)
ar: المدة (بالأسابيع)

source: Create Draft
ar: إنشاء مسودة

source: Assign Nutrition Plan
ar: تعيين خطة تغذية

# set_calorie_macro_targets
source: Set calorie and macro targets.
ar: تحديد أهداف السعرات والماكروز.

source: Daily Calories
ar: السعرات اليومية

# protein_grams
source: Protein (g)
ar: البروتين (جم)

# carbs_grams
source: Carbs (g)
ar: الكربوهيدرات (جم)

# fats_grams
source: Fats (g)
ar: الدهون (جم)

source: Assign Plan
ar: تعيين الخطة

source: Broadcast Message
ar: رسالة جماعية

source: Recipients
ar: المستلمون

source: Message
ar: الرسالة

source: Type your announcement
ar: اكتب إعلانك

source: Send
ar: إرسال

source: All Members
ar: جميع الأعضاء

source: Schedule Session
ar: جدولة جلسة

source: Session Type
ar: نوع الجلسة

source: Date
ar: التاريخ

source: Time
ar: الوقت

source: Overview
ar: نظرة عامة

source: Training
ar: التدريب

source: InBody
ar: إنبودي

source: Messages
ar: الرسائل

source: Member Profile
ar: الملف الشخصي للعضو
